import { FormEvent, useState } from "react";
import { AiInput } from "../Input/AiInput";

type AiTasks = Array<{
    title:string,
    desc:string,
}> 
    

export function NewTaskAI(){
    const [tasks,setTasks] = useState([] as AiTasks)


    const onSubmit = (e:FormEvent)=>{
        e.preventDefault()

        const formData = new FormData(e.target as HTMLFormElement)
        const text = formData.get("aiText")

        if (!text) {
            return
        }

        setTasks([
            {
                title:"Nom de la tache",
                desc:"Description de la tâche",
            },
             {
                title:"Nom de la tache",
                desc:"Description de la tâche",
            },
             {
                title:"Nom de la tache",
                desc:"Description de la tâche",
            }
        ])
    }

    return(
        <div className="flex flex-col gap-[46px]">
            <div className="flex items-center gap-[8px]">
                <svg
                    width="19"
                    height="19"
                    viewBox="0 0 19 19"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                >
                    <path
                        d="M8.24333 0.574802C8.60336 -0.19163 9.69352 -0.19163 10.0535 0.574802L12.351 5.46554C12.4501 5.67658 12.6199 5.84634 12.8309 5.94548L17.7216 8.2429C18.4881 8.60293 18.4881 9.69309 17.7216 10.0531L12.8309 12.3505C12.6199 12.4497 12.4501 12.6194 12.351 12.8305L10.0535 17.7212C9.69352 18.4876 8.60336 18.4876 8.24333 17.7212L5.9459 12.8305C5.84677 12.6194 5.677 12.4497 5.46597 12.3505L0.575229 10.0531C-0.191203 9.69309 -0.191203 8.60293 0.575229 8.2429L5.46597 5.94547C5.677 5.84634 5.84677 5.67658 5.9459 5.46554L8.24333 0.574802Z"
                        fill="#FF8B42"
                    />
                </svg>
                <h5 className="font-semibold text-[24px] text-[#1F1F1F]">{!tasks.length ? "Créer une tâche" : "Vos tâches..."}</h5>
            </div>

            <div className="h-[460px] overflow-y-scroll">
                {tasks && 
                    <ul className="flex flex-col gap-[24px]">
                        {tasks.map((t)=>
                            <li key={t.title} className="py-[25px] pl-[40px] flex flex-col gap-[32px] border border-[#E5E7EB] bg-[#FFFFFF] rounded-[10px]">
                                <div className="flex flex-col gap-[2px]">
                                    <h6 className="font-semibold text-[18px] text-[#000000]">{t.title}</h6>
                                    <p className="text-[#6B7280] text-[14px]">{t.desc}</p>
                                </div>
                                <div className="flex items-center gap-[15px]">
                                    <button className="cursor-pointer flex items-center text-[#6B7280] text-[12px] gap-[8.5px]">
                                        <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M11.1973 3.96191H11.2012V11.957C11.201 13.035 10.2991 13.908 9.19043 13.9082H2.96094C1.84889 13.9081 0.951388 13.0351 0.951172 11.957V3.96191H0.954102V3.95898H11.1973V3.96191ZM8.30957 0.0341797C8.44372 0.0341329 8.57719 0.0601006 8.70117 0.111328C8.8251 0.162624 8.93829 0.23825 9.0332 0.333008C9.12802 0.42782 9.20349 0.541202 9.25488 0.665039C9.30579 0.788043 9.33257 0.920612 9.33301 1.05371H11.5303C11.5449 1.05373 11.5598 1.05653 11.5742 1.05762L9.3291 1.05664L9.33008 1.05762H11.5303C11.5404 1.05763 11.5505 1.06005 11.5605 1.06055H11.6006C11.6129 1.06198 11.6255 1.06526 11.6377 1.06738C11.6466 1.06896 11.6553 1.07128 11.6641 1.07324C11.6975 1.08049 11.73 1.09011 11.7617 1.10254C11.7636 1.10331 11.7657 1.1037 11.7676 1.10449C11.8419 1.1345 11.9108 1.17756 11.9688 1.23535C12.0849 1.35148 12.1501 1.50962 12.1504 1.67383V2.20215C12.1502 2.28323 12.1336 2.3636 12.1025 2.43848C12.0713 2.51352 12.0254 2.58227 11.9678 2.63965C11.9103 2.69678 11.8425 2.74253 11.7676 2.77344C11.6925 2.80435 11.6115 2.82045 11.5303 2.82031H0.618164C0.537116 2.82039 0.455769 2.80438 0.380859 2.77344C0.306207 2.7425 0.237862 2.69673 0.180664 2.63965C0.123467 2.58235 0.0778239 2.51329 0.046875 2.43848C0.0160196 2.36366 -8.13692e-05 2.28308 0 2.20215V1.67383C-8.46362e-05 1.59267 0.014965 1.51155 0.0458984 1.43652C0.0768758 1.36151 0.122397 1.29284 0.179688 1.23535C0.237004 1.17786 0.305922 1.13278 0.380859 1.10156C0.455797 1.0704 0.537005 1.05388 0.618164 1.05371H2.81543C2.81545 1.0297 2.81666 1.00533 2.81836 0.981445V1.05762L2.82031 1.00586V0.945312C2.83062 0.849339 2.85468 0.754632 2.8916 0.665039C2.94288 0.540775 3.01823 0.427087 3.11328 0.332031C3.20834 0.236982 3.32203 0.161623 3.44629 0.110352C3.5703 0.0592494 3.70376 0.0338671 3.83789 0.0341797H8.30957ZM15.6992 1.06055H11.6006C11.592 1.05954 11.5829 1.05825 11.5742 1.05762L15.6992 1.06055ZM2.82031 0.945312C2.81905 0.957152 2.81918 0.969555 2.81836 0.981445V0L2.82031 0.945312Z" fill="#9CA3AF"/>
                                        </svg>
                                        Supprimer
                                    </button>

                                    <span aria-hidden="true" className="h-[11px] border border-[#9CA3AF] rounded-[80px]"></span>

                                    <button className="cursor-pointer flex items-center text-[#6B7280] text-[12px] gap-[8.5px]">
                                        <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M6.84794 2.94394L0.538902 9.25297C0.451971 9.33995 0.397399 9.45403 0.384248 9.57629L0.00327009 13.004C-0.0050645 13.0793 0.00257643 13.1555 0.025694 13.2277C0.0488115 13.2999 0.0868858 13.3663 0.137432 13.4228C0.187978 13.4792 0.24986 13.5244 0.319037 13.5553C0.388215 13.5862 0.463133 13.6022 0.538902 13.6022C0.558705 13.6022 0.578492 13.6011 0.598178 13.5989L4.02806 13.2179C4.15032 13.2048 4.2644 13.1502 4.35138 13.0633L10.6583 6.7548L6.84794 2.94394Z" fill="#6B7280"/>
                                            <path d="M13.1294 1.99777L11.605 0.473317C11.3018 0.170252 10.8907 0 10.462 0C10.0334 0 9.62225 0.170252 9.31909 0.473317L7.61035 2.18206L11.4207 5.99292L13.1299 4.28363C13.4329 3.98041 13.6031 3.56925 13.603 3.14059C13.6029 2.71193 13.4325 2.30085 13.1294 1.99777Z" fill="#6B7280"/>
                                        </svg>  
                                        Modifier
                                    </button>
                                </div>
                            </li>
                        )}
                    </ul>
                }
            </div>

            <form onSubmit={onSubmit}>
                <label className="out-screen" htmlFor="ai-text">Décrivez les tâches que vous souhaitez ajouter...</label>
                <AiInput/>
            </form>
           
        </div>
    )
}